[
    {
        "vacancies_name": "Python Developer (MDR)",
        "salary_avg": 0,
        "snippet": "Опыт разработки на python и желание использовать Java или JavaScript в работе. Умение разбираться в чужом коде. Практика использования TDD. ",
        "responsibility": "Количество современных угроз возрастает c каждым днем, и теперь необходимы продукты на базе технологий Big Data и Machine Learning для...",
        "schedule": "Полный день",
        "url": "https://hh.ru/vacancy/109157262"
    },
    {
        "vacancies_name": "QA Automation Engineer (Python) [DSP]",
        "salary_avg": 0,
        "snippet": "Опыт разработки тестов python+pytest. Опыт автоматизации тестирования от 3х лет. Умение читать код и понимать, как он работает. ",
        "responsibility": "Писать автотесты для backend и frontend на Python. Разрабатывать архитектуру тестов. Сопровождать тестовые задачи. Работать с дефектами: обнаружение, документирование, отслеживание. ",
        "schedule": "Удаленная работа",
        "url": "https://hh.ru/vacancy/112685686"
    },
    {
        "vacancies_name": "Senior Support Engineer [CX Platform]",
        "salary_avg": 0,
        "snippet": "Уверенный пользователь Linux (CLI). Умение написания скриптов на bash, python. Опыт работы с реляционными СУБД: написание SQL-запросов, процедур, view...",
        "responsibility": "Разбор заявок, приходящих через Service Desk, диагностика проблем пользователей. Диагностика проблем и устранение аварий на системе. Разбор проблем взаимодействия со...",
        "schedule": "Полный день",
        "url": "https://hh.ru/vacancy/112647593"
    },
    {
        "vacancies_name": "Python разработчик (MLOps команда)",
        "salary_avg": 0,
        "snippet": "Крепкое знание python3 (asyncio, mutiprocessing/multithreading, организация кода, работа с менеджерами зависимостями). Умение проектировать и развивать архитектуру сервисов. ",
        "responsibility": "Выстраивать MLOps и CI/CD процессы. Развивать инструментарий ML-платформы. Заниматься мониторингом и обеспечением бесперебойной работы ML-платформы. ",
        "schedule": "Полный день",
        "url": "https://hh.ru/vacancy/110211393"
    },
    {
        "vacancies_name": "Senior python developer",
        "salary_avg": 0,
        "snippet": "Крепкое знание python3 (опыт от 4-5 лет). Умение проектировать и развивать архитектуру сервиса. Умение писать нормальный код, работа...",
        "responsibility": "Разрабатывать высокопроизводительные сервисы на Python. Заниматься переработкой существующих сервисов - рефакторинг, оптимизация, переработка архитектуры, отказоустойчивость. Развивать продукт - разрабатывать новые продуктовые фичи...",
        "schedule": "Полный день",
        "url": "https://hh.ru/vacancy/93628316"
    }
]