class Company:
    """ Класс компании содержит данные по компании"""
    def __init__(self, id_hhru: int,
                 name: str,
                 description: str,
                 site_url: str,
                 industries:str,
                 vacancies: list
    ):
        self.__id_hhru = id_hhru
        self.__name = name
        self.__description = description
        self.__site_url = site_url
        self.__industries =industries
        self.vacancies = vacancies


""" 
{"id":"1740",
"name":"Яндекс",
"description":"<p><strong>Будет сложно, будет интересно</strong></p> <p>Яндекс — одна из крупнейших IT-компаний в России. Мы развиваем самую популярную в стране поисковую систему и создаем сервисы для миллионов людей. </p> <p>Благодаря нашим технологиям то, что вчера казалось фантастикой, сегодня становится реальностью. Пару лет назад мы не могли представить, что можно мгновенно узнать адрес ближайшей работающей аптеки, находясь в любой точке города. Что такси не надо ждать или заказывать заранее. Что можно заказать свежий хлеб, и его привезут прямо домой за 15 минут. А сейчас это всё — совершенно обычные вещи.</p> <p><strong>Наши технологии </strong></p> <p>С нами работают сильные математики и разработчики, которые создают сложные и уникальные технологии. Именно технологии позволяют нам делать сервисы, которые приносят пользу людям. </p> <p>Во многих наших продуктах используются машинное обучение и нейронные сети. На их основе создаются и развиваются новые технологии, которые востребованы во всём мире. Например, беспилотные автомобили Яндекса уже проходят испытания на дорогах России, Израиля и США. Платформой Yandex.Cloud пользуются крупные международные компании. Сервис онлайн-заказа такси Yango доступен в семнадцати странах. </p> <p><strong>Наша команда</strong></p> <p>В Яндексе вы найдёте профессионалов, с которыми приятно работать вместе, единомышленников, с которыми нескучно отдыхать, и экспертов, у которых можно многому научиться. Все вместе мы создаем такие технологии и продукты, которые один человек не смог бы сделать даже за тысячу лет.</p>   <p><strong>Наши направления</strong></p> <p>Мы развиваем несколько бизнес-направлений: </p> <ul> <li> <p>Это поиск, рекламные, облачные и портальные сервисы, к которым относится работа над Алисой и умными устройствами. </p> </li> <li> <p>Это сервисы онлайн-заказа такси, товаров и еды. Например, Маркет и Лавка. </p> </li> <li> <p>Это беспилотные автомобили. </p> </li> <li> <p>Это сервисы объявлений: Недвижимость и Работа.</p> </li> <li> <p>Это Плюс и развлекательные сервисы: Музыка, Афиша и Кинопоиск. </p> </li> </ul> <p>Какие-то из этих направлений и сервисов существуют давно, а какие-то появились недавно. Мы постоянно ищем новые направления, проводим эксперименты и проверяем разные идеи и гипотезы.</p> <p><strong>Карьерные возможности</strong></p> <p>Внутри Яндекса много разных команд: от маленьких стартапов до подразделений с давней историей.  Вы можете выбирать проекты и задачи, которые кажутся вам интересными, и переходить из одного проекта в другой благодаря возможностям ротации. У нас есть система наставничества, можно участвовать в международных конференциях, учиться внутри компании и снаружи.</p> <p><strong>Откуда можно работать </strong></p> <p>У нас есть 20 офисов в России и 17 офисов в других странах.</p>   <p><strong>Условия работы</strong></p> <ul> <li> <p>Комфортные офисы, где есть место не только для работы, но и для спорта и отдыха. Офисы открыты для сотрудников 24/7. </p> </li> <li> <p>Гибкий график работы.</p> </li> <li> <p>Дресс-код описан одной фразой: на работу нужно приходить одетыми. </p> </li> <li> <p>Начиная с первого дня работы у каждого сотрудника есть объёмный пакет услуг ДМС. Также мы компенсируем 80% стоимости полиса ДМС для супругов и детей. </p> </li> <li> <p>Доход сотрудников складывается из зарплаты и премий по итогам ревью, которые проходят в компании дважды в год.</p> </li> <li> <p>Для специалистов высокой квалификации есть программы жилищного займа: под 3% или вообще без процентов. </p> </li> </ul>",
"site_url":"https://yandex.ru/jobs/",
"industries":[{
	"id":"7.541",
	"name":"Интернет-компания (поисковики, платежные системы, соц.сети, информационно-познавательные и развлекательные ресурсы, продвижение сайтов и прочее)"
"area":{"id":"113","name":"Россия",}
	}]
	"""